{
    "Great Lakes": [
        {
            "name" : "Creamy Potato & Wild Rice Soup",
            "ingredients" : [
                "6 strips bacon", 
                "1 small onion, chopped",
                "2 C. washed and fully cooked Red Lake Nation Wild Rice",
                "3 C. Chicken Stock",
                "2 cans (10.75 oz.) Cream of Potato soup",
                "2 C. half & half",
                "1/2 C. sliced fresh mushrooms",
                "2 C. shredded cheddar cheese"
            ],
            "instructions" : [
                "Combine all ingredients (except cheese & half & half) in a 3-quart saucepan or Dutch oven.",
                "Simmer for about 20-30 minutes.",
                "Turn off heat and gently pour in half & half."
            ],
            "notes" : "RLNF made this recipe using Quick Cook Wild Rice & fat-free half & half, reducing shredded cheese to 1 Cup."
        },
        {
            "name" : "Wild Rice Bread by Polly Rohde",
            "ingredients" : [
                "1 1/2 C. Buttermilk",
                "1/4 C. Oil",
                "1/4 C. Honey",
                "2 tsp. Salt",
                "1/2 tsp. Baking Soda",
                "3 1/2 C. Bread Flour (White)",
                "1/2 C. Red Lake Nation Wild Rice Flour",
                "1/4 C. Wheat Germ",
                "1 1/4 tsp. Yeast",
                "4 tsp. Wheat Gluten",
                "1 C. Red Lake Nation Soup Bits (Cooked & cooled to room temperature)"
            ],
            "instructions" : [
                "Place all ingredients, except wild rice, in bread machine according to manufacturer's instructions.",
                "Set machine to 'Basic Setting' and 2# loaf size OR choose dough cycle.",
                "Add cooked wild rice after dough has formed.",
                "If using dough cycle, take bread dough out when the machine signals it's finished and place in a greased loaf pan.",
                "Let rise in a warm place until doubled in size.",
                "Bake at 350 degrees for approximately 45 minutes or until bread sounds hollow when tapped.",
                "Take out of pan and cool on a rack."
            ]
        },
        {
            "name" : "Wild Rice Stuffed Peppers",
            "ingredients" : [
                "1/2 C. Red Lake Nation Wild Rice, cooked",
                "4 Tbsp. butter",
                "1/4 C. diced red bell pepper",
                "1/4 C. diced yellow bell pepper",
                "1/4 C, diced orange bell pepper",
                "1/4 diced green onion",
                "1 C. vegetable stock",
                "1 C. bread cubes, dried",
                "1 Tbsp. fresh sage, chopped or 1 tsp poultry seasoning",
                "3 bell peppers, halved & seeded",
                "4 oz. light cream cheese",
                "1 Tbsp. light sour cream",
                "1/4 C. Parmaesan cheese, shredded"
            ],
            "Instructions" : [
                "1. Preheat the oven to 350 degrees. Chop the onion & bell peppers. ",
                "2. Melt butter in saute pan on stove & saute onions & peppers until tender crisp. Add stock, bring to boil over medium heat.",
                "3. Remove from heat, add breadcubes & seasonings. Toss all together to make a stuffing.",
                "4. Add softened cream cheese, Parmaesan cheese. Mix well. Stuff pepper halves with this mixture, sprinkle with additional Parmaesan cheese for garnish & bake for 45 minutes or until browned on top & pepper is cooked through. Top with salt, pepper, and/or parsley for a pop of green color."
            ]
        },
        {
            "name" : "Small Batch Wild Blueberry Lime Jam",
            "ingredients" : [
                "4 C. wild blueberries",
                "1 C. granulated sugar",
                "zest of 2 limes (you could also use lemons)",
                "1/4 C. lime juice",
                "pinch of  salt"
            ],
            "Instructions" : [
                "Rinse fruit and pat dry. In a medium saucepan combine berries, sugar, salt, lime juice & zest.",
                "Cook over medium heat until it reaches a low boil. Stir constantly. Mash fruit up using an immersion blender or potato masher. (I used a masher as I like my jam chunky). Allow to simmer for 25-30 minutes. Ladle into sterilized 8 oz jars and cover. with clean lids & bands. Process in a water bath for 10 minutes. You can also keep this jam in the fridge without water bath processing, but be sure to consume within 14 days.",
                "Makes 2-8 oz jars or 1 pint."
            ]
        },
        {
            "name" : "Bannock",
            "ingredients" :[
                "3 cp all purpose flour",
                "2 T baking powder",
                "1/4 on butter, melted",
                "1 1/2 cp water",
                "1 t salt"
            ],
            "Directions" : [
                "1. Add flour, baking powder, salt to a large mixing bowl. Stir to mix. Pour melted butter and water into flour mixture. Stir with fork and make ball. 2. Turn dough out on a slightly floured surface. Kneed gently 10 times. Pat dough into a 3/4 inch circle. 3. Cook in a greased frying pan for 30 mins, over a medium heat. Allowing 15 mins per side."
            ]
        },
        {
            "name" : "Wild Rice Soup",
            "ingredients" : [
                "6 cp water", 
                "1 lb venison or beef",
                "1 cp wild rice",
                "3 T olive oil",
                "3 stalks of celery, chopped",
                "1 can of mushrooms, chopped",
                "3 cans of cream of chicken soup",
                "2 beef buillon",
                "1 T red pepper flakes",
                "Salt & pepper to taste"
            ],
            "Directions" : [
                "1. Brown meat in a large cooking pot, drain grease 2. Add celery, onion, buillon, and 2 cp water. Let simmer 3. When boiling, add rice and let it simmer for 45 mins 4. Add cream of chicken soup, 4 cp water, mushrooms, red pepper, and salt & pepper. 5. Lower heat and cook gently for another 30 mins (till rice is done)"
            ]
        },
        {
            "name" : "2 Potatoes Salad",
            "ingredients" : [
                "3 med. potatoes. Peeled",
                "1 large sweet potato, peeled and halved",
                "1/2 cp mayo",
                "2 T sugar",
                "1 t white vinegar",
                "1 t salt",
                "3/4 t dill weed",
                "1/2 t pepper",
                "1 med. sweet onion"
            ],
            "Directions" : [
                "1. Place the potatoes on a large saucepan and cover with water. Bring to a boil. Reduce the heat; cover and cook for 20-40 mins or until potatoes are just tender.",
                "2. Meanwhile, in a small bowl, whisk the mayo, sugar, vinegar, salt, dill, and pepper.",
                "3. Drain potatoes; cube and place in a large serving bowl. Cool slightly. Add onion and dressing, stir gently to coat. Cover and refrigerate for 2 hours or overnight."
            ]
        }
    ]  
}
